#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.networking.data.aws_availability_zones.available: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.networking.aws_subnet.multi_cloud_aws[0] will be created
  + resource "aws_subnet" "multi_cloud_aws" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-2a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.22.0.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.networking.aws_subnet.multi_cloud_aws[1] will be created
  + resource "aws_subnet" "multi_cloud_aws" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-2b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.22.32.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.networking.aws_subnet.multi_cloud_aws[2] will be created
  + resource "aws_subnet" "multi_cloud_aws" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-2c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.22.64.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.networking.aws_vpc.multi_cloud_aws will be created
  + resource "aws_vpc" "multi_cloud_aws" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.22.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
    }

  # module.networking.google_compute_network.multi_cloud_gcp will be created
  + resource "google_compute_network" "multi_cloud_gcp" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + ipv4_range                      = (known after apply)
      + name                            = "multi-cloud-gcp"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # module.networking.google_compute_subnetwork.multi_cloud_gcp_subnet will be created
  + resource "google_compute_subnetwork" "multi_cloud_gcp_subnet" {
      + creation_timestamp = (known after apply)
      + enable_flow_logs   = (known after apply)
      + fingerprint        = (known after apply)
      + gateway_address    = (known after apply)
      + id                 = (known after apply)
      + ip_cidr_range      = "10.12.0.0/16"
      + name               = "multi-cloud-gcp-subnet"
      + network            = (known after apply)
      + project            = (known after apply)
      + region             = (known after apply)
      + secondary_ip_range = (known after apply)
      + self_link          = (known after apply)
    }

  # module.vpn.aws_customer_gateway.customer_gateway_1 will be created
  + resource "aws_customer_gateway" "customer_gateway_1" {
      + arn        = (known after apply)
      + bgp_asn    = "64567"
      + id         = (known after apply)
      + ip_address = (known after apply)
      + type       = "ipsec.1"
    }

  # module.vpn.aws_customer_gateway.customer_gateway_2 will be created
  + resource "aws_customer_gateway" "customer_gateway_2" {
      + arn        = (known after apply)
      + bgp_asn    = "64567"
      + id         = (known after apply)
      + ip_address = (known after apply)
      + type       = "ipsec.1"
    }

  # module.vpn.aws_route_table.main will be created
  + resource "aws_route_table" "main" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + vpc_id           = (known after apply)
    }

  # module.vpn.aws_route_table_association.main[0] will be created
  + resource "aws_route_table_association" "main" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpn.aws_route_table_association.main[1] will be created
  + resource "aws_route_table_association" "main" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpn.aws_route_table_association.main[2] will be created
  + resource "aws_route_table_association" "main" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpn.aws_vpn_connection.cx_1 will be created
  + resource "aws_vpn_connection" "cx_1" {
      + arn                            = (known after apply)
      + customer_gateway_configuration = (known after apply)
      + customer_gateway_id            = (known after apply)
      + id                             = (known after apply)
      + routes                         = (known after apply)
      + static_routes_only             = (known after apply)
      + transit_gateway_attachment_id  = (known after apply)
      + tunnel1_address                = (known after apply)
      + tunnel1_bgp_asn                = (known after apply)
      + tunnel1_bgp_holdtime           = (known after apply)
      + tunnel1_cgw_inside_address     = (known after apply)
      + tunnel1_inside_cidr            = (known after apply)
      + tunnel1_preshared_key          = (sensitive value)
      + tunnel1_vgw_inside_address     = (known after apply)
      + tunnel2_address                = (known after apply)
      + tunnel2_bgp_asn                = (known after apply)
      + tunnel2_bgp_holdtime           = (known after apply)
      + tunnel2_cgw_inside_address     = (known after apply)
      + tunnel2_inside_cidr            = (known after apply)
      + tunnel2_preshared_key          = (sensitive value)
      + tunnel2_vgw_inside_address     = (known after apply)
      + type                           = "ipsec.1"
      + vgw_telemetry                  = (known after apply)
      + vpn_gateway_id                 = (known after apply)
    }

  # module.vpn.aws_vpn_connection.cx_2 will be created
  + resource "aws_vpn_connection" "cx_2" {
      + arn                            = (known after apply)
      + customer_gateway_configuration = (known after apply)
      + customer_gateway_id            = (known after apply)
      + id                             = (known after apply)
      + routes                         = (known after apply)
      + static_routes_only             = (known after apply)
      + transit_gateway_attachment_id  = (known after apply)
      + tunnel1_address                = (known after apply)
      + tunnel1_bgp_asn                = (known after apply)
      + tunnel1_bgp_holdtime           = (known after apply)
      + tunnel1_cgw_inside_address     = (known after apply)
      + tunnel1_inside_cidr            = (known after apply)
      + tunnel1_preshared_key          = (sensitive value)
      + tunnel1_vgw_inside_address     = (known after apply)
      + tunnel2_address                = (known after apply)
      + tunnel2_bgp_asn                = (known after apply)
      + tunnel2_bgp_holdtime           = (known after apply)
      + tunnel2_cgw_inside_address     = (known after apply)
      + tunnel2_inside_cidr            = (known after apply)
      + tunnel2_preshared_key          = (sensitive value)
      + tunnel2_vgw_inside_address     = (known after apply)
      + type                           = "ipsec.1"
      + vgw_telemetry                  = (known after apply)
      + vpn_gateway_id                 = (known after apply)
    }

  # module.vpn.aws_vpn_gateway.vpn_gateway will be created
  + resource "aws_vpn_gateway" "vpn_gateway" {
      + amazon_side_asn = (known after apply)
      + arn             = (known after apply)
      + id              = (known after apply)
      + vpc_id          = (known after apply)
    }

  # module.vpn.google_compute_external_vpn_gateway.aws_gateway will be created
  + resource "google_compute_external_vpn_gateway" "aws_gateway" {
      + description     = "VPN gateway on AWS side"
      + id              = (known after apply)
      + name            = "aws-gateway"
      + project         = (known after apply)
      + redundancy_type = "FOUR_IPS_REDUNDANCY"
      + self_link       = (known after apply)

      + interface {
          + id         = 0
          + ip_address = (known after apply)
        }
      + interface {
          + id         = 1
          + ip_address = (known after apply)
        }
      + interface {
          + id         = 2
          + ip_address = (known after apply)
        }
      + interface {
          + id         = 3
          + ip_address = (known after apply)
        }
    }

  # module.vpn.google_compute_ha_vpn_gateway.target_gateway will be created
  + resource "google_compute_ha_vpn_gateway" "target_gateway" {
      + id             = (known after apply)
      + name           = "vpn-to-aws"
      + network        = (known after apply)
      + project        = (known after apply)
      + region         = (known after apply)
      + self_link      = (known after apply)
      + vpn_interfaces = (known after apply)
    }

  # module.vpn.google_compute_router.main will be created
  + resource "google_compute_router" "main" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "router-main"
      + network            = (known after apply)
      + project            = (known after apply)
      + region             = (known after apply)
      + self_link          = (known after apply)

      + bgp {
          + advertise_mode = "DEFAULT"
          + asn            = 64567
        }
    }

  # module.vpn.google_compute_router_interface.gcp_to_aws_1 will be created
  + resource "google_compute_router_interface" "gcp_to_aws_1" {
      + id         = (known after apply)
      + ip_range   = (known after apply)
      + name       = "interface-to-aws-ha-1"
      + project    = (known after apply)
      + region     = (known after apply)
      + router     = "router-main"
      + vpn_tunnel = "vpn-tunnel-to-aws-ha1"
    }

  # module.vpn.google_compute_router_interface.gcp_to_aws_2 will be created
  + resource "google_compute_router_interface" "gcp_to_aws_2" {
      + id         = (known after apply)
      + ip_range   = (known after apply)
      + name       = "interface-to-aws-ha-2"
      + project    = (known after apply)
      + region     = (known after apply)
      + router     = "router-main"
      + vpn_tunnel = "vpn-tunnel-to-aws-ha2"
    }

  # module.vpn.google_compute_router_interface.gcp_to_aws_3 will be created
  + resource "google_compute_router_interface" "gcp_to_aws_3" {
      + id         = (known after apply)
      + ip_range   = (known after apply)
      + name       = "interface-to-aws-ha-3"
      + project    = (known after apply)
      + region     = (known after apply)
      + router     = "router-main"
      + vpn_tunnel = "vpn-tunnel-to-aws-ha3"
    }

  # module.vpn.google_compute_router_interface.gcp_to_aws_4 will be created
  + resource "google_compute_router_interface" "gcp_to_aws_4" {
      + id         = (known after apply)
      + ip_range   = (known after apply)
      + name       = "interface-to-aws-ha-4"
      + project    = (known after apply)
      + region     = (known after apply)
      + router     = "router-main"
      + vpn_tunnel = "vpn-tunnel-to-aws-ha4"
    }

  # module.vpn.google_compute_router_peer.gcp_to_aws_1 will be created
  + resource "google_compute_router_peer" "gcp_to_aws_1" {
      + advertise_mode            = "DEFAULT"
      + advertised_route_priority = 100
      + id                        = (known after apply)
      + interface                 = "interface-to-aws-ha-1"
      + ip_address                = (known after apply)
      + management_type           = (known after apply)
      + name                      = "peer-aws-1"
      + peer_asn                  = (known after apply)
      + peer_ip_address           = (known after apply)
      + project                   = (known after apply)
      + region                    = (known after apply)
      + router                    = "router-main"
    }

  # module.vpn.google_compute_router_peer.gcp_to_aws_2 will be created
  + resource "google_compute_router_peer" "gcp_to_aws_2" {
      + advertise_mode            = "DEFAULT"
      + advertised_route_priority = 100
      + id                        = (known after apply)
      + interface                 = "interface-to-aws-ha-2"
      + ip_address                = (known after apply)
      + management_type           = (known after apply)
      + name                      = "peer-aws-2"
      + peer_asn                  = (known after apply)
      + peer_ip_address           = (known after apply)
      + project                   = (known after apply)
      + region                    = (known after apply)
      + router                    = "router-main"
    }

  # module.vpn.google_compute_router_peer.gcp_to_aws_3 will be created
  + resource "google_compute_router_peer" "gcp_to_aws_3" {
      + advertise_mode            = "DEFAULT"
      + advertised_route_priority = 100
      + id                        = (known after apply)
      + interface                 = "interface-to-aws-ha-3"
      + ip_address                = (known after apply)
      + management_type           = (known after apply)
      + name                      = "peer-aws-3"
      + peer_asn                  = (known after apply)
      + peer_ip_address           = (known after apply)
      + project                   = (known after apply)
      + region                    = (known after apply)
      + router                    = "router-main"
    }

  # module.vpn.google_compute_router_peer.gcp_to_aws_4 will be created
  + resource "google_compute_router_peer" "gcp_to_aws_4" {
      + advertise_mode            = "DEFAULT"
      + advertised_route_priority = 100
      + id                        = (known after apply)
      + interface                 = "interface-to-aws-ha-4"
      + ip_address                = (known after apply)
      + management_type           = (known after apply)
      + name                      = "peer-aws-4"
      + peer_asn                  = (known after apply)
      + peer_ip_address           = (known after apply)
      + project                   = (known after apply)
      + region                    = (known after apply)
      + router                    = "router-main"
    }

  # module.vpn.google_compute_vpn_tunnel.gcp_to_aws_1 will be created
  + resource "google_compute_vpn_tunnel" "gcp_to_aws_1" {
      + creation_timestamp              = (known after apply)
      + detailed_status                 = (known after apply)
      + id                              = (known after apply)
      + ike_version                     = 2
      + label_fingerprint               = (known after apply)
      + local_traffic_selector          = (known after apply)
      + name                            = "vpn-tunnel-to-aws-ha1"
      + peer_external_gateway           = (known after apply)
      + peer_external_gateway_interface = 0
      + peer_ip                         = (known after apply)
      + project                         = (known after apply)
      + region                          = (known after apply)
      + remote_traffic_selector         = (known after apply)
      + router                          = "router-main"
      + self_link                       = (known after apply)
      + shared_secret                   = (sensitive value)
      + shared_secret_hash              = (known after apply)
      + tunnel_id                       = (known after apply)
      + vpn_gateway                     = (known after apply)
      + vpn_gateway_interface           = 0
    }

  # module.vpn.google_compute_vpn_tunnel.gcp_to_aws_2 will be created
  + resource "google_compute_vpn_tunnel" "gcp_to_aws_2" {
      + creation_timestamp              = (known after apply)
      + detailed_status                 = (known after apply)
      + id                              = (known after apply)
      + ike_version                     = 2
      + label_fingerprint               = (known after apply)
      + local_traffic_selector          = (known after apply)
      + name                            = "vpn-tunnel-to-aws-ha2"
      + peer_external_gateway           = (known after apply)
      + peer_external_gateway_interface = 1
      + peer_ip                         = (known after apply)
      + project                         = (known after apply)
      + region                          = (known after apply)
      + remote_traffic_selector         = (known after apply)
      + router                          = "router-main"
      + self_link                       = (known after apply)
      + shared_secret                   = (sensitive value)
      + shared_secret_hash              = (known after apply)
      + tunnel_id                       = (known after apply)
      + vpn_gateway                     = (known after apply)
      + vpn_gateway_interface           = 0
    }

  # module.vpn.google_compute_vpn_tunnel.gcp_to_aws_3 will be created
  + resource "google_compute_vpn_tunnel" "gcp_to_aws_3" {
      + creation_timestamp              = (known after apply)
      + detailed_status                 = (known after apply)
      + id                              = (known after apply)
      + ike_version                     = 2
      + label_fingerprint               = (known after apply)
      + local_traffic_selector          = (known after apply)
      + name                            = "vpn-tunnel-to-aws-ha3"
      + peer_external_gateway           = (known after apply)
      + peer_external_gateway_interface = 2
      + peer_ip                         = (known after apply)
      + project                         = (known after apply)
      + region                          = (known after apply)
      + remote_traffic_selector         = (known after apply)
      + router                          = "router-main"
      + self_link                       = (known after apply)
      + shared_secret                   = (sensitive value)
      + shared_secret_hash              = (known after apply)
      + tunnel_id                       = (known after apply)
      + vpn_gateway                     = (known after apply)
      + vpn_gateway_interface           = 1
    }

  # module.vpn.google_compute_vpn_tunnel.gcp_to_aws_4 will be created
  + resource "google_compute_vpn_tunnel" "gcp_to_aws_4" {
      + creation_timestamp              = (known after apply)
      + detailed_status                 = (known after apply)
      + id                              = (known after apply)
      + ike_version                     = 2
      + label_fingerprint               = (known after apply)
      + local_traffic_selector          = (known after apply)
      + name                            = "vpn-tunnel-to-aws-ha4"
      + peer_external_gateway           = (known after apply)
      + peer_external_gateway_interface = 3
      + peer_ip                         = (known after apply)
      + project                         = (known after apply)
      + region                          = (known after apply)
      + remote_traffic_selector         = (known after apply)
      + router                          = "router-main"
      + self_link                       = (known after apply)
      + shared_secret                   = (sensitive value)
      + shared_secret_hash              = (known after apply)
      + tunnel_id                       = (known after apply)
      + vpn_gateway                     = (known after apply)
      + vpn_gateway_interface           = 1
    }

Plan: 30 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: t.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "t.tfplan"

```

</details>

*Pusher: @rytswd, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform for Kubernetes Setup`*